---
kind: property
id: P:Autodesk.Revit.DB.DisplacementPath.PathStyle
source: html/b812339e-d1c8-6303-5538-091fdbcaf838.htm
---
# Autodesk.Revit.DB.DisplacementPath.PathStyle Property

Specifies the style of the path.

## Syntax (C#)
```csharp
public DisplacementPathStyle PathStyle { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration